CREATE DATABASE  IF NOT EXISTS `king_shop` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `king_shop`;
-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: localhost    Database: king_shop
-- ------------------------------------------------------
-- Server version	8.0.37

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `buy_order`
--

DROP TABLE IF EXISTS `buy_order`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `buy_order` (
  `id` int NOT NULL AUTO_INCREMENT,
  `member_name` varchar(45) DEFAULT NULL,
  `member_account` varchar(45) DEFAULT NULL,
  `member_password` varchar(45) DEFAULT NULL,
  `shop_name` varchar(45) DEFAULT NULL,
  `menu_000_name` varchar(45) DEFAULT NULL,
  `menu_001_name` varchar(45) DEFAULT NULL,
  `menu_002_name` varchar(45) DEFAULT NULL,
  `menu_000_price` int DEFAULT NULL,
  `menu_000_count` int DEFAULT NULL,
  `menu_001_price` int DEFAULT NULL,
  `menu_001_count` int DEFAULT NULL,
  `menu_002_price` int DEFAULT NULL,
  `menu_002_count` int DEFAULT NULL,
  `buy_sum` int DEFAULT NULL,
  `buy_date` varchar(45) DEFAULT NULL,
  `buy_time` varchar(45) DEFAULT NULL,
  `buy_state` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `buy_order`
--

LOCK TABLES `buy_order` WRITE;
/*!40000 ALTER TABLE `buy_order` DISABLE KEYS */;
INSERT INTO `buy_order` VALUES (12,'張昭','1111','2222','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',100,2,110,2,120,2,660,'2024-06-28','13:54:10','準備中'),(17,'張紘','2222','22222','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',100,3,110,2,120,3,880,'2024-06-28','15:24:14','未讀取'),(18,'張紘','2222','22222','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',100,4,110,5,120,1,1070,'2024-06-28','15:24:24','未讀取'),(19,'張紘','2222','22222','紫薇店','綠豆牛奶冰','花生牛奶冰','招牌牛奶冰',40,2,45,2,50,3,320,'2024-06-28','17:41:35','已取餐'),(20,'張紘','2222','22222','紫薇店','綠豆牛奶冰','花生牛奶冰','招牌牛奶冰',40,5,45,6,50,7,820,'2024-06-28','17:41:47','已取餐'),(21,'張紘','2222','22222','紫薇店','綠豆牛奶冰','花生牛奶冰','招牌牛奶冰',40,9,45,9,50,9,1215,'2024-06-28','17:42:02','已取餐'),(22,'孫悟空','3333','3333','紫薇店','綠豆牛奶冰','花生牛奶冰','招牌牛奶冰',40,2,45,1,50,2,225,'2024-06-28','20:26:25','請取餐'),(23,'呂布','00004','00004','北區店','招牌便當','雙拼便當','排骨便當',110,1,130,1,90,1,330,'2024-06-29','08:56:49','未讀取'),(24,'呂布','00004','00004','北區店','招牌便當','雙拼便當','排骨便當',110,24,130,3,90,3,3300,'2024-06-29','08:57:05','未讀取'),(25,'呂布','00004','00004','中區店','燒肉拼盤','冷筍沙拉','鮭魚生魚片',100,1,180,2,220,3,1120,'2024-06-29','08:57:14','請取餐'),(26,'呂布','00004','00004','中區店','燒肉拼盤','冷筍沙拉','鮭魚生魚片',100,3,180,3,220,3,1500,'2024-06-29','08:57:24','請取餐'),(27,'呂布','00004','00004','中區店','燒肉拼盤','冷筍沙拉','鮭魚生魚片',100,5,180,11,220,8,4240,'2024-06-29','08:57:47','準備中'),(31,'丁原','00003','00003','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',100,2,110,2,120,1,540,'2024-06-29','09:27:50','未讀取'),(32,'丁原','00003','00003','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',100,4,110,5,120,4,1430,'2024-06-29','09:27:59','未讀取'),(33,'丁原','00003','00003','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',100,2,110,1,120,4,790,'2024-06-29','09:28:10','準備中'),(34,'丁原','00003','00003','紫薇店','綠豆牛奶冰','花生牛奶冰','招牌牛奶冰',40,3,45,5,50,3,495,'2024-06-29','09:28:24','請取餐'),(35,'丁原','00003','00003','紫薇店','綠豆牛奶冰','花生牛奶冰','招牌牛奶冰',40,6,45,5,50,6,765,'2024-06-29','09:28:34','請取餐'),(36,'丁原','00003','00003','北區店','招牌便當','雙拼便當','排骨便當',110,2,130,2,90,2,660,'2024-06-29','09:28:49','未讀取'),(37,'丁原','00003','00003','北區店','招牌便當','雙拼便當','排骨便當',110,4,130,6,90,5,1670,'2024-06-29','09:29:00','未讀取'),(38,'丁原','00003','00003','北區店','招牌便當','雙拼便當','排骨便當',110,7,130,6,90,5,2000,'2024-06-29','09:29:12','未讀取'),(39,'丁原','00003','00003','中區店','燒肉拼盤','冷筍沙拉','鮭魚生魚片',100,2,180,2,220,3,1220,'2024-06-29','09:29:27','未讀取'),(40,'丁原','00003','00003','中區店','燒肉拼盤','冷筍沙拉','鮭魚生魚片',100,5,180,5,220,5,2500,'2024-06-29','09:29:38','未讀取'),(41,'丁原','00003','00003','中區店','燒肉拼盤','冷筍沙拉','鮭魚生魚片',100,7,180,9,220,7,3860,'2024-06-29','09:29:50','未讀取'),(42,'孫悟空','3333','3333','水星店','竹筍炒肉絲','牛雞雙寶便當','招牌便當',80,1,150,2,120,3,740,'2024-06-29','09:42:57','未讀取'),(43,'孫悟空','3333','3333','水星店','竹筍炒肉絲','牛雞雙寶便當','招牌便當',80,2,150,2,120,2,700,'2024-06-29','09:43:07','未讀取'),(44,'孫悟空','3333','3333','水星店','竹筍炒肉絲','牛雞雙寶便當','招牌便當',80,4,150,5,120,6,1790,'2024-06-29','09:43:17','未讀取'),(45,'孫悟空','3333','3333','中區店','燒肉拼盤','冷筍沙拉','鮭魚生魚片',100,1,180,1,220,1,500,'2024-06-29','09:43:27','未讀取'),(46,'孫悟空','3333','3333','中區店','燒肉拼盤','冷筍沙拉','鮭魚生魚片',100,8,180,12,220,6,4280,'2024-06-29','09:43:41','未讀取'),(47,'孫悟空','3333','3333','北區店','招牌便當','雙拼便當','排骨便當',110,4,130,4,90,4,1320,'2024-06-29','09:43:52','未讀取'),(48,'孫悟空','3333','3333','北區店','招牌便當','雙拼便當','排骨便當',110,7,130,8,90,4,2170,'2024-06-29','09:44:04','未讀取'),(49,'孫悟空','3333','3333','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',100,1,110,1,120,2,450,'2024-06-29','09:44:11','準備中'),(50,'孫悟空','3333','3333','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',100,1,110,2,120,1,440,'2024-06-29','09:44:19','未讀取'),(51,'張昭','1111','2222','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',100,2,110,2,120,2,660,'2024-06-29','10:05:07','未讀取'),(52,'周瑜','00005','00005','火星店','豬肉炒麵','牛肉炒麵','海鮮炒麵',110,1,120,2,130,3,740,'2024-06-29','11:08:28','未讀取');
/*!40000 ALTER TABLE `buy_order` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-06-29 12:13:37
